app/Controllers/VisitorRegistration.php

SELECT *
FROM `visitor`
ORDER BY `id` DESC
---
    public function lists()
    {
        $model = new VisitorModel();
        $data['visitors'] = $model->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `visitor`
WHERE `id` = '1'
 LIMIT 1
---
    public function view($id = null)
    {
        $model = new VisitorModel();
        $data['visitor'] = $model->where('id', $id)->first();

DELETE FROM `visitor`
WHERE `id` = '1'
AND `id` IN ('1')
---
    public function delete($id = null)
    {
        $model = new VisitorModel();
        $data['user'] = $model->where('id', $id)->delete($id);